In [1]:
import os
import numpy
import json
import csv
import pandas as pd
import datetime
import pymongo
from sqlalchemy import create_engine

In [2]:
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"
user_id = "ani_ponugoti"
pwd = "PineApple53!"

ports = {"mongo" : 27017, "mysql" : 3306}

atlas_cluster_name = "sakila"
atlas_default_dbname = "admin"
atlas_user_name = "ani_ponugoti"
atlas_password = "PineApple"

conn_str = {"local" : f"mongodb://{host_name}:{ports['mongo']}/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.zvzvnbm.mongodb.net/test?authSource={atlas_default_dbname}"
}
#mongodb+srv://ani_ponugoti:PineApple53!@midtermproject.0d9an0v.mongodb.net/test
#mongodb+srv://ani_ponugoti:PineApple@sakila.zvzvnbm.mongodb.net/test

print(conn_str["local"])
print(conn_str["atlas"])

src_dbname = "sakila"
dst_dbname = "sakila_dw"

mongodb://localhost:27017/
mongodb+srv://ani_ponugoti:PineApple@sakila.zvzvnbm.mongodb.net/test?authSource=admin

In [3]:
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe

def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def get_mongo_dataframe_local(user_id, pwd, host_name, port, db_name, collection, query):
    '''Create a connection to MongoDB, with or without authentication credentials'''
    if user_id and pwd:
        mongo_uri = 'mongodb://%s:%s@%s:%s/%s' % (username, password, host, port, db_name)
        client = pymongo.MongoClient(mongo_uri)
    else:
        conn_str = f"mongodb://{host_name}:{port}/"
        client = pymongo.MongoClient(conn_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.reset_index().to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [4]:
conn_str1 = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str1, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

In [5]:
sql_customer = "SELECT * FROM sakila.customer;"
df_customer = get_sql_dataframe(user_id, pwd, host_name, src_dbname, sql_customer)
df_customer.head(5)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-15 04:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-15 04:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [7]:
#f = open("sakila-inventory.json")
#inventory = json.load(f)
#with open("sakila-inventory.json") as f:
#    inventory = json.load(f)
#print(inventory)

df_payment = pd.read_json("sakila-payment.json")
df_payment.head(5)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30
2,3,1,1,1185,5.99,2005-06-15 00:54:12,2006-02-15 22:12:30
3,4,1,2,1422,0.99,2005-06-15 18:02:53,2006-02-15 22:12:30
4,5,1,2,1476,9.99,2005-06-15 21:08:46,2006-02-15 22:12:30

In [11]:
client = pymongo.MongoClient(conn_str["atlas"])
db = client[src_dbname]

data_dir = os.path.join(os.getcwd())

data_dict = []

csv_files = {"rental" : 'sakila-rental.csv'}

for file in csv_files:
    csv_f = os.path.join(data_dir, csv_files[file])
    with open(csv_f, 'r') as openfile:
        reader = csv.DictReader(openfile)
        list_reader = list(reader)
        file = db[file]
        #print(list_reader)
        #count = 1
        #for i in list_reader:
            #print(count)
            #print(i.keys())
            #print([type(k) for k in i.keys()])
            #count += 1
        #print(list_reader.keys())
        result = file.insert_many(list_reader)

        
client.close()

In [12]:
query = {}
collection = "rental"
df_rental = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_rental.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [13]:
# Customer dimension table
drop_cols = ["email", "address_id", "active", "create_date", "last_update"]
df_customer.drop(drop_cols, axis=1, inplace=True)
df_customer.rename(columns={"customer_id": "customer_key"}, inplace=True)
df_customer

#df_customers.rename(columns={"id":"customer_key"}, inplace=True)

     customer_key  store_id first_name  last_name
0               1         1       MARY      SMITH
1               2         1   PATRICIA    JOHNSON
2               3         1      LINDA   WILLIAMS
3               4         2    BARBARA      JONES
4               5         1  ELIZABETH      BROWN
..            ...       ...        ...        ...
594           595         1   TERRENCE  GUNDERSON
595           596         1    ENRIQUE   FORSYTHE
596           597         1    FREDDIE     DUGGAN
597           598         1       WADE   DELVALLE
598           599         2     AUSTIN    CINTRON

[599 rows x 4 columns]

In [15]:
# drop_cols = ["last_update"]
# df_inventory.drop(drop_cols, axis=1, inplace=True)
# df_inventory.rename(columns={"inventory_id": "inventory_key"}, inplace=True)
# df_inventory

drop_cols = ["staff_id", "last_update"]
df_payment.drop(drop_cols, axis=1, inplace=True)
df_payment.rename(columns={"payment_id": "payment_key"}, inplace=True)
df_payment.head(5)

   payment_key  customer_id  rental_id  amount         payment_date
0            1            1         76    2.99  2005-05-25 11:30:37
1            2            1        573    0.99  2005-05-28 10:35:23
2            3            1       1185    5.99  2005-06-15 00:54:12
3            4            1       1422    0.99  2005-06-15 18:02:53
4            5            1       1476    9.99  2005-06-15 21:08:46

In [17]:
# drop_cols = ["description", "original_language_id", "last_update"]
# df_film.drop(drop_cols, axis=1, inplace=True)
# df_film.rename(columns={"film_id": "film_key"}, inplace=True)
# #df_film.reset_index()
# df_film.head(5)
drop_cols = ["inventory_id", "staff_id", "last_update"]
df_rental.drop(drop_cols, axis=1, inplace=True)
df_rental.rename(columns={"rental_id": "rental_key"}, inplace=True)
df_rental.head(5)

  rental_key          rental_date customer_id          return_date
0          1  2005-05-24 22:53:30         130  2005-05-26 22:04:30
1          2  2005-05-24 22:54:33         459  2005-05-28 19:40:33
2          3  2005-05-24 23:03:39         408  2005-06-01 22:12:39
3          4  2005-05-24 23:04:41         333  2005-06-03 01:43:41
4          5  2005-05-24 23:05:21         222  2005-06-02 04:33:21

In [20]:
db_operation = "insert"
tables = [('dim_customer', df_customer, 'customer_key'),
          ('dim_payment', df_payment, 'payment_key'),
          ('dim_rental', df_rental, 'rental_key(100)')]

In [21]:
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [34]:
sql_fact_orders = """SELECT r.rental_id as rental_key,
r.rental_date,
r.customer_id,
r.return_date,
p.payment_id,
p.amount,
p.payment_date,
c.store_id,
c.first_name,
c.last_name
FROM rental r JOIN payment p ON r.rental_id = p.rental_id JOIN customer c ON p.customer_id = c.customer_id;"""
df_fact_orders = get_sql_dataframe(user_id, pwd, host_name, src_dbname, sql_fact_orders)
df_fact_orders

,rental_key,rental_date,customer_id,return_date,payment_id,amount,payment_date,store_id,first_name,last_name
0,76,2005-05-25 11:30:37,1,2005-06-03 12:00:37,1,2.99,2005-05-25 11:30:37,1,MARY,SMITH
1,573,2005-05-28 10:35:23,1,2005-06-03 06:32:23,2,0.99,2005-05-28 10:35:23,1,MARY,SMITH
2,1185,2005-06-15 00:54:12,1,2005-06-23 02:42:12,3,5.99,2005-06-15 00:54:12,1,MARY,SMITH
3,1422,2005-06-15 18:02:53,1,2005-06-19 15:54:53,4,0.99,2005-06-15 18:02:53,1,MARY,SMITH
4,1476,2005-06-15 21:08:46,1,2005-06-25 02:26:46,5,9.99,2005-06-15 21:08:46,1,MARY,SMITH
...,...,...,...,...,...,...,...,...,...,...
16039,14599,2005-08-21 17:43:42,599,2005-08-22 18:53:42,16045,4.99,2005-08-21 17:43:42,2,AUSTIN,CINTRON
16040,14719,2005-08-21 21:41:57,599,2005-08-25 20:37:57,16046,1.99,2005-08-21 21:41:57,2,AUSTIN,CINTRON
16041,15590,2005-08-23 06:09:44,599,2005-09-01 06:53:44,16047,8.99,2005-08-23 06:09:44,2,AUSTIN,CINTRON
16042,15719,2005-08-23 11:08:46,599,2005-08-25 07:25:46,16048,2.99,2005-08-23 11:08:46,2,AUSTIN,CINTRON
16043,15725,2005-08-23 11:25:00,599,2005-08-26 11:46:00,16049,2.99,2005-08-23 11:25:00,2,AUSTIN,CINTRON

In [35]:
table_name = "fact_orders"
pk_column = "rental_key"
db_operation = "insert"
set_dataframe(user_id, pwd, host_name, dst_dbname, df_fact_orders, table_name, pk_column, db_operation)